---
kind: type
id: T:Autodesk.Revit.DB.Visual.MasonryCMUPatternType
source: html/d56d3704-b966-ad65-03ad-de9a8ac00332.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMUPatternType

The enumerated type representing the permitted values for the asset property "MasonryCMUPattern" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public enum MasonryCMUPatternType
```